In [1]:
import numpy as np
import pandas as pd
import re

In [17]:
files = 'Material Data/ABS/2016 2014 2012 all full-time.xlsx'
sheet = pd.ExcelFile(files)
ABS_2016 = sheet.parse('2016')

In [18]:
ABS_2016.head(5)

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
0,CHIEF EXECUTIVES AND MANAGING DIRECTORS,2675.5,2618.0,2665.2
1,GENERAL MANAGERS,2871.1,2309.5,2713.9
2,LEGISLATORS,NaN,0.0,NaN
3,CROP FARMERS,NaN,0.0,NaN
4,LIVESTOCK FARMERS,NaN,0.0,NaN

In [19]:
files = 'Material Data/ABS/2016 2014 2012 all full-time.xlsx'
sheet = pd.ExcelFile(files)
ABS_2014 = sheet.parse('2014')

In [20]:
ABS_2014.head(5)

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
0,CHIEF EXECUTIVES AND MANAGING DIRECTORS,2755.1,2808.6,2765.0
1,GENERAL MANAGERS,2819.7,1963.9,2573.6
2,LEGISLATORS,NaN,0.0,NaN
3,CROP FARMERS,1613.9,0.0,1613.9
4,LIVESTOCK FARMERS,NaN,NaN,1711.7

In [21]:
files = 'Material Data/ABS/2016 2014 2012 all full-time.xlsx'
sheet = pd.ExcelFile(files)
ABS_2012 = sheet.parse('2012')

In [22]:
ABS_2012.head(5)

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
0,CHIEF EXECUTIVES AND MANAGING DIRECTORS,2697.7,2019.1,2553.4
1,GENERAL MANAGERS,2583.1,1567.4,2384.1
2,LEGISLATORS,NaN,0.0,NaN
3,CROP FARMERS,1171.0,0.0,1171.0
4,LIVESTOCK FARMERS,NaN,NaN,1015.0

### Filter occupations

In [23]:
occup_2016 = ABS_2016[['OCCUPATIONS']]

In [27]:
occup_2016.head(5)

                               OCCUPATIONS
0  CHIEF EXECUTIVES AND MANAGING DIRECTORS
1                         GENERAL MANAGERS
2                              LEGISLATORS
3                             CROP FARMERS
4                        LIVESTOCK FARMERS

In [25]:
occup_2014 = ABS_2014[['OCCUPATIONS']]

In [28]:
occup_2014.head(5)

                               OCCUPATIONS
0  CHIEF EXECUTIVES AND MANAGING DIRECTORS
1                         GENERAL MANAGERS
2                              LEGISLATORS
3                             CROP FARMERS
4                        LIVESTOCK FARMERS

In [26]:
occup_2012 = ABS_2012[['OCCUPATIONS']]

In [29]:
occup_2012.head(5)

                               OCCUPATIONS
0  CHIEF EXECUTIVES AND MANAGING DIRECTORS
1                         GENERAL MANAGERS
2                              LEGISLATORS
3                             CROP FARMERS
4                        LIVESTOCK FARMERS

In [33]:
len(occup_2016)

354

In [34]:
len(occup_2014)

356

In [35]:
len(occup_2012)

353

###  Merge 2016 and 2014

In [31]:
dfoccup_2016_14 = pd.merge(occup_2016, occup_2014, how = 'inner')

In [32]:
len(dfoccup_2016_14)

352

#### Check what are uncommon value of 2016

In [39]:
occup_2016[~occup_2016.OCCUPATIONS.isin(dfoccup_2016_14.OCCUPATIONS)]

                          OCCUPATIONS
5    MIXED CROP AND LIVESTOCK FARMERS
189   CANVAS AND LEATHER GOODS MAKERS

#### Check what are uncommon value of 2014

In [40]:
occup_2014[~occup_2014.OCCUPATIONS.isin(dfoccup_2016_14.OCCUPATIONS)]

                                       OCCUPATIONS
23   SENIOR NON-COMMISSIONED DEFENCE FORCE MEMBERS
163                                FLOOR FINISHERS
197                                      JEWELLERS
220            DEFENCE FORCE MEMBERS - OTHER RANKS

###  Merge 2012 and 2016_14

In [36]:
dfoccup_2016_14_12 = pd.merge(dfoccup_2016_14, occup_2012, how = 'inner')

In [37]:
len(dfoccup_2016_14_12)

350

In [43]:
occup_2016[~occup_2016.OCCUPATIONS.isin(dfoccup_2016_14_12.OCCUPATIONS)]

                          OCCUPATIONS
5    MIXED CROP AND LIVESTOCK FARMERS
179                          SHEARERS
189   CANVAS AND LEATHER GOODS MAKERS
333               AQUACULTURE WORKERS

In [42]:
occup_2014[~occup_2014.OCCUPATIONS.isin(dfoccup_2016_14_12.OCCUPATIONS)]

                                       OCCUPATIONS
23   SENIOR NON-COMMISSIONED DEFENCE FORCE MEMBERS
163                                FLOOR FINISHERS
180                                       SHEARERS
197                                      JEWELLERS
220            DEFENCE FORCE MEMBERS - OTHER RANKS
335                            AQUACULTURE WORKERS

In [41]:
occup_2012[~occup_2012.OCCUPATIONS.isin(dfoccup_2016_14_12.OCCUPATIONS)]

                         OCCUPATIONS
162                  FLOOR FINISHERS
188  CANVAS AND LEATHER GOODS MAKERS
196                        JEWELLERS

### Write dfoccup_2016_14_12 as Final Occupation

In [63]:
writer = pd.ExcelWriter('Material Data/ABS OCCUP FINAL.xlsx')
dfoccup_2016_14_12.to_excel(writer,sheet_name = 'Sheet1', index = False)
writer.save()

### Validation 1: Check again with final list yesterday

In [52]:
files = 'Material Data/Final Occupation List.xlsx'
sheet = pd.ExcelFile(files)
ABS_Final_Yest = sheet.parse('Sheet2')

In [53]:
ABS_Final_Yest.head(5)

                               OCCUPATIONS
0  CHIEF EXECUTIVES AND MANAGING DIRECTORS
1                         GENERAL MANAGERS
2                              LEGISLATORS
3                             CROP FARMERS
4                        LIVESTOCK FARMERS

In [54]:
len(ABS_Final_Yest)

350

In [55]:
dfoccup_check = pd.merge(dfoccup_2016_14_12,ABS_Final_Yest, how = 'inner')

In [56]:
len(dfoccup_check)

348

In [57]:
dfoccup_2016_14_12[~dfoccup_2016_14_12.OCCUPATIONS.isin(dfoccup_check.OCCUPATIONS)]

                               OCCUPATIONS
334  MIXED CROP AND LIVESTOCK FARM WORKERS
349                        ALL OCCUPATIONS

In [58]:
ABS_Final_Yest[~ABS_Final_Yest.OCCUPATIONS.isin(dfoccup_check.OCCUPATIONS)]

                         OCCUPATIONS
162                  FLOOR FINISHERS
335  MIXED CROP AND LIVESTOCK FARMER

Decide to use the dfoccup_2016_14_12 as the final occupation list.